import scipy.stats as stats 


#----------------------------------------------------------

#سکه ای را  10 بار پرتاب کنید. اگر حداقل  ۷بار شیر ببینید، برنده بازی هستید، در غیر این صورت شما
#بازنده هستید

# n=10
# p=0.5
# x_values=[7,8,9,10]
# sum_prob=0
# for x in x_values:
#     prob=stats.binom.pmf(x,n,p)
#     #sum_prob+=prob
# print(f"p(x>=7):{sum_prob:.4f}")
# print(100*"-")
#-----------------------------------------------------------------------------------

#یک موسسه بیمه، بیمه نامه های عمر را به 5 نفر می فروشد. احتمال اینکه یک فرد  30 سال یا بیشتر عمر
#کند، 2/3است

#الف) احتمال اینکه بعد از  0۱سال هر پنج نفر هنوز زنده باشند
#n=5
#p=2/3
#x=5
#prob=stats.binom.pmf(x,n,p)
#print(f"p(x={x}):{prob:.4f}")

#ب) احتمال اینکه حداقل سه نفر هنوز زنده باشند
# n=5
# p=2/3
# x_values=[3,4,5]
# sum_prob=0
# for x in x_values:
#     prob=stats.binom.pmf(x,n,p)
#     sum_prob+=prob
# print(f"p(x>=3):{sum_prob:.4f}")

#ج) احتمال اینکه دقیقاً دو نفر هنوز زنده باشند.
# n=5
# p=2/3
# x=2
# prob=stats.binom.pmf(x,n,p)
# print(f"p(x={x}):{prob:.4f}")

#-----------------------------------------------------------------------

#فرض کنید صاحب یک شرکت تولید لامپ تشخیص می دهد که از هر 75 لامپ  3 لامپ معیوب است
#الف) احتمال اینکه او اولین لامپ معیوب را در ششمین لامپ که آزمایش کرده است پیدا کند چقدر است 

# p=0.04
# x=6
# prob=stats.geom.pmf(x,p)
# print(f"p(x={x}):{prob:.4f}")